### Mnipulaçao de dados ausentes

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Criando um DF que tem algumas infos ausentes,
df = pd.DataFrame({'A': [1,2,np.nan],
                  'B': [5, np.nan, np.nan],
                  'C': [1,2,3]})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
# dropna é um metodo que vai jogar fora linhas e colunas q tem valores ausentes...
# esse é o resultado fznd cortes nas linhas
# 0 = linhas e 1 = colunas, para olhar apertar shift + tab na func
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [5]:
# pegando a coluna 1, tudo q tem Nan, e thresh seria o limite de num ausentes, pra ele decidir descartar
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

### Preencher dados com NaN

In [6]:
# sempre que encontrar um NaN, ele troca por 0,
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [7]:
# preenchendo com uma string,
df.fillna('Conteudo')

          A         B  C
0       1.0       5.0  1
1       2.0  Conteudo  2
2  Conteudo  Conteudo  3

In [8]:
# media dos valores
df["A"].mean()
# df["A"].sum()

1.5

In [10]:
# retorna a media dos valores
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [11]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [12]:
# preeche os dados com a ultima observação acima, 
# util para series temporais,
df.ffill()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [13]:
# Faz o inverso, pega os valores debaixo e joga p anteriores.. nn funciona mto bem aqui pq esta NaN 
df.bfill()

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3